Revit 2026 API

# AdvancedWoodWoodLatewoodSharpness Property

---

The property labeled "Percentage of pure latewood" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodLatewoodSharpness { get; }
```
```vb
Public Shared ReadOnly Property WoodLatewoodSharpness As String
	Get
```
```cpp
public:
static property String^ WoodLatewoodSharpness {
	String^ get ();
}
```
```fsharp
static member WoodLatewoodSharpness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace